app/views/gossips/card.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
	<li>Title : <%= @gossip_card.title %> </li>
	<li>Author : <%= @gossip_card.user.first_name %> </li>