app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
			    <h5 class="card-title mb-3"><%= gossip.title %></h5>
			    <h6 class="card-subtitle mb-5 text-muted"><%= gossip.user.first_name %></h6>

SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
---
			    btn-md btn-primary" %></button>
				<button type="button" class="btn btn-md btn-info"><%= gossip.likes.count %> 💙 </button>