app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
      <th scope="row">Auteur</th>
      <td><%= link_to "#{@gossip.user.first_name}", user_path(@gossip.user.id) %></td>

SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 2]]
---
    <tr>
      <button type="button" class="btn mb-3 btn-md btn-info"><%= @gossip.likes.count %> 💙 </button>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
---
<div class="container col-md-8 order-md-1">
<h3>Comments (<%= @gossip.comments.count %>)</h3>