app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
			    <h5 class="card-title mb-3"><%= gossip.title %></h5>
			    <h6 class="card-subtitle mb-5 text-muted"><%= gossip.user.first_name %></h6>