app/controllers/application_controller.rb

  def logged_in?
    current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]