app/controllers/comments_controller.rb

  def create
     @comment = Comment.create(content: params[:content], user_id: User.all.sample.id)
---
SELECT "users".* FROM "users"

  def show
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]