app/controllers/gossips_controller.rb

  def show
    @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]

  def create
    @gossip = Gossip.create(title: params[:title], content: params[:content])
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Agriculteur"], ["content", "j'aime labourer les champs, mais pas que ;)"], ["user_id", 49], ["created_at", "2019-02-07 14:02:48.643382"], ["updated_at", "2019-02-07 14:02:48.643382"]]

  def edit
    @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def update
    @gossip = Gossip.find(params[:id])

    if @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["title", "Michelitaaaa"], ["updated_at", "2019-02-07 15:16:32.019722"], ["id", 83]]

  def destroy
   @gossip = Gossip.find(params[:id])

   @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 89]]

 def index
  @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"