app/controllers/gossips_controller.rb

SELECT "users".* FROM "users"
---
  def create
    @gossip = Gossip.create(title: params[:title], content: params[:content], user_id: User.all.sample.id)