app/controllers/users_controller.rb

INSERT INTO "users" ("email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "cities".* FROM "cities"
---
  def create
    #@user = User.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password], city: params[:city])
    @user = User.create(first_name: params[:first_name], email: params[:email], password: params[:password], city_id: City.all.sample.id)